topics/camera/eos-kiss-x3.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Canon EOS Kiss X3 a.k.a 500D</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Canon EOS Kiss X3 a.k.a 500D"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-01 07:30:00 EDT"/>
<meta name="author" content="Brett Viren"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Canon EOS Kiss X3 a.k.a 500D</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Making friends with the ThinkPad and Linux</a>
<ul>
<li><a href="#sec-1-1">1.1 Transferring photo files</a></li>
<li><a href="#sec-1-2">1.2 Talking over USB</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Permissions</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 gPhoto2</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 Capture a picture</a></li>
<li><a href="#sec-1-3-2">1.3.2 Configuring the camera</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Making friends with the ThinkPad and Linux</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Transferring photo files</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Normally I transfer files using the built-in card reader and gthumb to
organize them by date, put the card back in the camera and use it to
erase all.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Talking over USB</h3>
<div class="outline-text-3" id="text-1-2">


<p>
The laptop can also talk to it over USB.  
</p>

</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Permissions</h4>
<div class="outline-text-4" id="text-1-2-1">


<p>
On Debian one needs to add a config line for UDEV to get the
permissions correct.  My user is already in the "plugdev" group which
give permissions to various USB devices.  For the camera, connect it
and check system messages to get the vendor and product IDs:
</p>



<pre class="example">bv@hal:~&gt; dmesg|grep -B3 'Canon Digital Camera'
[46036.380278] usb 1-1.1: new high-speed USB device number 10 using ehci_hcd
[46036.474930] usb 1-1.1: New USB device found, idVendor=04a9, idProduct=31cf
[46036.474934] usb 1-1.1: New USB device strings: Mfr=1, Product=2, SerialNumber=0
[46036.474937] usb 1-1.1: Product: Canon Digital Camera
</pre>


<p>
You can also get it from <code>lsusb</code> but the camera may need to be woken up.
</p>



<pre class="example">bv@hal:~&gt; lsusb|grep Canon
Bus 001 Device 012: ID 04a9:31cf Canon, Inc. 
</pre>


<p>
Armed with the vendor and product ID numbers add a config line for
UDEV like shown:
</p>



<pre class="example">bv@hal:~&gt; cat /etc/udev/rules.d/50-camera.rules
# canon eos 500d
SYSFS{idVendor}=="04a9", SYSFS{idProduct}=="31cf", GROUP="plugdev", MODE="0660"
# lenovo built-in web cam
SYSFS{idVendor}=="04f2", SYSFS{idProduct}=="b217", GROUP="plugdev", MODE="0660"
</pre>



</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> gPhoto2</h3>
<div class="outline-text-3" id="text-1-3">


<p>
With the above done and the camera awake check it with <code>gphoto2</code>.
</p>



<pre class="example">bv@hal:~&gt; gphoto2 --auto-detect
Model                          Port                                            
----------------------------------------------------------
Canon EOS 500D                 usb:001,010     
bv@hal:~&gt; gphoto2 -a
Abilities for camera             : Canon EOS 500D                              
Serial port support              : no
USB support                      : yes
Capture choices                  :
                                 : Image
                                 : Preview
Configuration support            : yes
Delete selected files on camera  : yes
Delete all files on camera       : no
File preview (thumbnail) support : yes
File upload support              : yes
</pre>



</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Capture a picture</h4>
<div class="outline-text-4" id="text-1-3-1">


<p>
One shot:
</p>



<pre class="example">bv@hal:~&gt; gphoto2 --capture-image-and-download --force-overwrite
New file is in location /capt0000.jpg on the camera                            
Saving file as capt0000.jpg
Deleting file /capt0000.jpg on the camera
Deleting 'capt0000.jpg' from folder '/'...
</pre>


<p>
A series with intervals:
</p>



<pre class="example">bv@hal:~&gt; gphoto2 --capture-image-and-download --interval 1 --frames 5
Time-lapse mode enabled (interval: 1s).                                        
Capturing frame #1/5...
...
</pre>


<p>
Controlling the filename
</p>



<pre class="example">bv@hal:~&gt; gphoto2 --capture-image-and-download --filename "%Y%m%d%H%M%S.jpg"
New file is in location /capt0000.jpg on the camera                            
Saving file as 20120630152411.jpg
Deleting file /capt0000.jpg on the camera
Deleting 'capt0000.jpg' from folder '/'...
bv@hal:~&gt; ls -l 20120630152411.jpg 
-rw-r--r-- 1 bv bv 5566167 Jun 30 15:24 20120630152411.jpg
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Configuring the camera</h4>
<div class="outline-text-4" id="text-1-3-2">


<ul>
<li id="sec-1-3-2-1">Listing configuration items<br/>




<pre class="example">bv@hal:~&gt; gphoto2 --list-config
/main/actions/bulb                                                             
/main/actions/uilock
/main/actions/syncdatetime
/main/actions/autofocusdrive
/main/actions/manualfocusdrive
/main/actions/eoszoom
/main/actions/eoszoomposition
/main/actions/eosviewfinder
/main/actions/eosremoterelease
/main/settings/datetime
/main/settings/reviewtime
/main/settings/output
/main/settings/movierecord
/main/settings/evfmode
/main/settings/ownername
/main/settings/artist
/main/settings/copyright
/main/settings/customfuncex
/main/settings/capturetarget
/main/settings/capture
/main/status/model
/main/status/ptpversion
/main/status/batterylevel
/main/status/lensname
/main/status/serialnumber
/main/status/shuttercounter
/main/status/availableshots
/main/imgsettings/imageformat
/main/imgsettings/imageformatsd
/main/imgsettings/whitebalancexa
/main/imgsettings/whitebalancexb
/main/capturesettings/exposurecompensation
/main/capturesettings/focusmode
/main/capturesettings/autoexposuremode
/main/capturesettings/drivemode
/main/capturesettings/picturestyle
/main/capturesettings/bracketmode
/main/other/d402
/main/other/d407
/main/other/d406
</pre>



</li>
</ul>
<ul>
<li id="sec-1-3-2-2">Querying values<br/>




<pre class="example">bv@hal:~&gt; for cfg in $(gphoto2 --list-config); do echo "$cfg: $(gphoto2 --get-config $cfg)"; done
/main/actions/bulb: Label: Bulb Mode
Type: TOGGLE
Current: 2
/main/actions/uilock: Label: UI Lock
Type: TOGGLE
Current: 2
/main/actions/syncdatetime: Label: Synchronize camera date and time with PC
Type: TOGGLE
Current: 0
/main/actions/autofocusdrive: Label: Drive Canon DSLR Autofocus
Type: TOGGLE
Current: 0
/main/actions/manualfocusdrive: Label: Drive Canon DSLR Manual focus
Type: RADIO
Current: None
Choice: 0 Near 1
Choice: 1 Near 2
Choice: 2 Near 3
Choice: 3 None
Choice: 4 Far 1
Choice: 5 Far 2
Choice: 6 Far 3
/main/actions/eoszoom: Label: Canon EOS Zoom
Type: TEXT
Current: 0
/main/actions/eoszoomposition: Label: Canon EOS Zoom Position
Type: TEXT
Current: 0,0
/main/actions/eosviewfinder: Label: Canon EOS Viewfinder
Type: TOGGLE
Current: 2
/main/actions/eosremoterelease: Label: Canon EOS Remote Release
Type: RADIO
Current: None
Choice: 0 None
Choice: 1 On 1
Choice: 2 On 2
Choice: 3 Off
Choice: 4 Immediate
/main/settings/datetime: Label: Camera Date and Time
Type: DATE
Current: 1341108114
Printable: Sat 30 Jun 2012 10:01:54 PM EDT
/main/settings/reviewtime: Label: Quick Review Time
Type: RADIO
Current: 8 seconds
Choice: 0 None
Choice: 1 2 seconds
Choice: 2 4 seconds
Choice: 3 8 seconds
Choice: 4 Hold
/main/settings/output: Label: Camera Output
Type: RADIO
Current: Unknown value 0000
Choice: 0 TFT
Choice: 1 PC
Choice: 2 Unknown value 0000
/main/settings/movierecord: Label: Movie Recording
Type: TEXT
Current: 0
/main/settings/evfmode: Label: EVF Mode
Type: RADIO
Current: 0
Choice: 0 0
/main/settings/ownername: Label: Owner Name
Type: TEXT
Current: 
/main/settings/artist: Label: Artist
Type: TEXT
Current: 
/main/settings/copyright: Label: Copyright
Type: TEXT
Current: 
/main/settings/customfuncex: Label: Custom Functions Ex
Type: TEXT
Current: d4,4,1,2c,3,101,1,0,103,1,0,10f,1,0,2,38,4,201,1,0,202,1,0,203,1,0,204,1,0,3,20,2,50e,1,0,60f,1,0,4,38,4,701,1,0,704,1,0,811,1,0,80f,1,0,
/main/settings/capturetarget: Label: Capture Target
Type: RADIO
Current: Internal RAM
Choice: 0 Internal RAM
Choice: 1 Memory card
/main/settings/capture: Label: Capture
Type: TOGGLE
Current: 0
/main/status/model: Label: Camera Model
Type: TEXT
Current: 2147484242
/main/status/ptpversion: Label: PTP Version
Type: TEXT
Current: 256
/main/status/batterylevel: Label: Battery Level
Type: TEXT
Current: 100%
/main/status/lensname: Label: Lens Name
Type: TEXT
Current: EF-S18-55mm f/3.5-5.6 IS
/main/status/serialnumber: Label: Serial Number
Type: TEXT
Current: 360113036
/main/status/shuttercounter: Label: Shutter Counter
Type: TEXT
Current: 4085
/main/status/availableshots: Label: Available Shots
Type: TEXT
Current: 50901
/main/imgsettings/imageformat: Label: Image Format
Type: RADIO
Current: Large Fine JPEG
Choice: 0 Large Fine JPEG
Choice: 1 Large Normal JPEG
Choice: 2 Medium Fine JPEG
Choice: 3 Medium Normal JPEG
Choice: 4 Small Fine JPEG
Choice: 5 Small Normal JPEG
Choice: 6 RAW + Large Fine JPEG
Choice: 7 RAW
/main/imgsettings/imageformatsd: Label: Image Format SD
Type: RADIO
Current: Large Fine JPEG
Choice: 0 Large Fine JPEG
Choice: 1 Large Normal JPEG
Choice: 2 Medium Fine JPEG
Choice: 3 Medium Normal JPEG
Choice: 4 Small Fine JPEG
Choice: 5 Small Normal JPEG
Choice: 6 RAW + Large Fine JPEG
Choice: 7 RAW
/main/imgsettings/whitebalancexa: Label: WhiteBalance X A
Type: TEXT
Current: 0
/main/imgsettings/whitebalancexb: Label: WhiteBalance X B
Type: TEXT
Current: 0
/main/capturesettings/exposurecompensation: Label: Exposure Compensation
Type: RADIO
Current: 0
Choice: 0 -2
Choice: 1 -1.6
Choice: 2 -1.3
Choice: 3 -1.0
Choice: 4 -0.6
Choice: 5 -0.3
Choice: 6 0
Choice: 7 0.3
Choice: 8 0.6
Choice: 9 1.0
Choice: 10 1.3
Choice: 11 1.6
Choice: 12 2
/main/capturesettings/focusmode: Label: Focus Mode
Type: RADIO
Current: AI Focus
Choice: 0 One Shot
Choice: 1 AI Focus
Choice: 2 AI Servo
/main/capturesettings/autoexposuremode: Label: Canon Auto Exposure Mode
Type: RADIO
Current: Green
Choice: 0 P
Choice: 1 TV
Choice: 2 AV
Choice: 3 Manual
Choice: 4 Bulb
Choice: 5 A_DEP
Choice: 6 DEP
Choice: 7 Custom
Choice: 8 Lock
Choice: 9 Green
Choice: 10 Night Portrait
Choice: 11 Sports
Choice: 12 Portrait
Choice: 13 Landscape
Choice: 14 Closeup
Choice: 15 Flash Off
/main/capturesettings/drivemode: Label: Drive Mode
Type: RADIO
Current: Single
Choice: 0 Single
Choice: 1 Timer 10 sec
/main/capturesettings/picturestyle: Label: Picture Style
Type: RADIO
Current: Standard
Choice: 0 Standard
Choice: 1 Portrait
Choice: 2 Landscape
Choice: 3 Neutral
Choice: 4 Faithful
Choice: 5 Monochrome
Choice: 6 User defined 1
Choice: 7 User defined 2
Choice: 8 User defined 3
/main/capturesettings/bracketmode: Label: Bracket Mode
Type: TEXT
Current: 0
/main/other/d402: Label: PTP Property 0xd402
Type: TEXT
Current: Canon EOS Kiss X3
/main/other/d407: Label: PTP Property 0xd407
Type: TEXT
Current: 1
/main/other/d406: Label: PTP Property 0xd406
Type: TEXT
Current: Unknown Initiator
</pre>



</li>
</ul>
<ul>
<li id="sec-1-3-2-3">Setting values<br/>




<pre class="example">bv@hal:~&gt; gphoto2 --set-config-value /main/settings/datetime=$(date +%s)
bv@hal:~&gt; gphoto2 --get-config /main/settings/datetime
Label: Camera Date and Time                                                    
Type: DATE
Current: 1341078961
Printable: Sat 30 Jun 2012 01:56:01 PM EDT
</pre>


</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-01 07:30:00 EDT</p>
<p class="author">Author: Brett Viren</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
